http://www.xavierdupre.fr/app/ensae_teaching_cs/helpsphinx/notebooks/td2a_cenonce_session_1.html

In [5]:
import pandas
from pandas import Series
import numpy
s = Series([42, 'Hello World!', 3.14, -5, None, numpy.nan])
s.head()

0              42
1    Hello World!
2            3.14
3              -5
4            None
dtype: object

In [8]:
f1 = pandas.read_excel('data/file1.xlsx', index_col=0) 
f1

      nom prenom                        iban
id
1   toto1  tutu2  CH93 0076 2011 6238 5295 7
2   toto2  tutu3  CH93 0076 2011 6238 5295 5
3   toto3  tutu4  CH93 0076 2011 6238 5295 4

In [11]:
f2 = pandas.read_excel('data/file2.xlsx', index_col=0) 
f2

      nom prenom                        iban
id
1   toto1  tutu2  CH93 0076 2011 6238 5295 7
2   toto2  tutu3  CH93 0076 2011 6238 5295 5
3   toto3  tutu4  CH93 0076 2011 6238 5295 4
4   toto4  tutu5  CH93 0076 2011 6238 5295 9

In [12]:
f1.merge(f2, left_on="iban", right_on="iban")

   nom_x prenom_x                        iban  nom_y prenom_y
0  toto1    tutu2  CH93 0076 2011 6238 5295 7  toto1    tutu2
1  toto2    tutu3  CH93 0076 2011 6238 5295 5  toto2    tutu3
2  toto3    tutu4  CH93 0076 2011 6238 5295 4  toto3    tutu4